app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", ""], ["text", ""], ["created_at", "2018-11-13 11:42:59.332713"], ["updated_at", "2018-11-13 11:42:59.332713"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = $1, "text" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "saya"], ["text", "saya"], ["updated_at", "2018-11-13 11:43:10.383671"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)